% p=0.5;%阈值为0.5时
% R=zeros(1,21);
% R(1)=0;

% p=0.7;%阈值为0.7时
% R07=zeros(1,21);
% R07(1)=0;

%p=0.75;%阈值为0.75时
%R075=zeros(1,21);
%R075(1)=0;

% p=0.76;%阈值为0.76时
% R076=zeros(1,21);
% R076(1)=0;

% p=0.755;%阈值为0.755时
% % R0755=zeros(1,21);
% % R0755(1)=0;

% p=0.8;%阈值为0.8时
% R08=zeros(1,21);
% R08(1)=0;

fprintf('p = %.3f\n',p);
A=0:0.05:1;%横坐标分量

for i=1:20
    x=i*0.05;
    R075(i+1)=p.*g(p.*g(x));
    fprintf('pga(pgb(%.2f))= %12.5f\n',x,R075(i));
end

plot(A,R075,'r',A,A,'-k')
xlabel('x');
ylabel('pga(pgb(x))');
title('p=0.75');
